[
  "cmenu-plugin",
  "calendar",
  "periodic-notes",
  "cm-editor-syntax-highlight-obsidian",
  "code-block-copy",
  "obsidian-activity-history",
  "sliding-panes-obsidian",
  "obsidian-memos",
  "cycle-through-panes",
  "obsidian42-brat",
  "simpread",
  "obsidian-reminder-plugin",
  "obsidian-kanban",
  "obsidian-admonition",
  "obsidian-excalidraw-plugin",
  "table-editor-obsidian",
  "url-into-selection",
  "obsidian-auto-link-title",
  "tag-wrangler",
  "find-unlinked-files",
  "recent-files-obsidian",
  "obsidian-spaced-repetition",
  "obsidian-dictionary-plugin",
  "obsidian-collapse-all-plugin",
  "file-explorer-note-count",
  "easy-typing-obsidian",
  "templater-obsidian",
  "obsidian-tasks-plugin",
  "dataview",
  "obsidian-dynamic-toc",
  "quick-explorer",
  "various-complements",
  "number-headings-obsidian",
  "note-refactor-obsidian",
  "highlightr-plugin",
  "lapel",
  "obsidian-git",
  "obsidian-linter",
  "obsidian-outliner"
]