[
  "convert-url-to-iframe",
  "obsidian-link-converter",
  "obsidian-git",
  "obsidian-admonition",
  "hotkey-helper",
  "obsidian-linter",
  "table-editor-obsidian",
  "sliding-panes-obsidian",
  "obsidian-enhancing-mindmap",
  "obsidian-activity-history",
  "obsidian-mind-map",
  "table-extended",
  "cm-editor-syntax-highlight-obsidian",
  "obsidian-annotator",
  "oz-image-plugin",
  "note-refactor-obsidian",
  "dataview",
  "obsidian-outliner",
  "obsidian-excalidraw-plugin",
  "obsidian-footnotes",
  "better-fn",
  "obsidian-pangu",
  "obsidian-kanban",
  "url-into-selection",
  "templater-obsidian",
  "code-block-copy",
  "obsidian-dictionary-plugin",
  "recent-files-obsidian",
  "file-tree-alternative",
  "obsidian-local-rest-api",
  "calendar",
  "tag-wrangler",
  "quickadd",
  "obsidian-emoji-toolbar",
  "find-unlinked-files",
  "markdown-prettifier",
  "obsidian-pandoc",
  "obsidian-spaced-repetition",
  "obsidian-advanced-uri",
  "obsidian-icon-folder",
  "obsidian-markmind",
  "obsidian-citation-plugin",
  "juggl",
  "review-obsidian",
  "obsidian-languagetool-plugin",
  "folder-note-plugin",
  "readwise-official",
  "darlal-switcher-plus"
]