[
  "obsidian-git",
  "obsidian-linter",
  "editing-toolbar",
  "better-fn",
  "obsidian-footnotes",
  "calendar",
  "obsidian-tidy-footnotes",
  "periodic-notes",
  "cmdr",
  "obsidian-activity-history",
  "easy-typing-obsidian",
  "dataview",
  "obsidian42-brat",
  "obsidian-hover-editor",
  "quickadd",
  "templater-obsidian",
  "omnisearch",
  "various-complements",
  "settings-search",
  "obsidian-icon-folder",
  "file-tree-alternative",
  "custom-sort",
  "obsidian-local-rest-api",
  "code-files",
  "obsidian-icons-plugin",
  "obsidian-code-preview",
  "tag-wrangler",
  "obsidian-tagfolder",
  "colored-tags",
  "multi-tag",
  "multi-properties",
  "obsidian-projects",
  "home-tab",
  "obsidian-custom-frames",
  "obsidian-emoji-toolbar",
  "surfing"
]