// 什么是函数式编程
// 1.函数式编程是一种编程范式，它将计算机运算视为函数的求值
// 2.函数式编程中的函数是一等公民，函数可以作为参数传递
// 3.函数式编程中的函数是一等公民，函数可以作为返回值使用
// 4.函数式编程中的函数是一等公民，函数可以作为变量进行赋值
// 5.函数式编程中的函数是一等公民，函数可以作为对象的属性进行赋值
// 6.函数式编程中的函数是一等公民，函数可以作为数组的元素进行赋值

// 什么是高阶函数
// 1.一个函数的参数是一个函数
// 2.一个函数的返回值是一个函数
// 3.一个函数的参数和返回值都是一个函数

// 什么是纯函数
// 1.函数的返回结果只依赖于它的参数
// 2.函数执行过程里面没有副作用

// 什么是柯里化
// 1.柯里化是把接受多个参数的函数转换成接受一个单一参数的函数，并且返回接受余下的参数而且返回结果的新函数
// 2.柯里化的本质是把一个多参数的函数转换成一个嵌套函数，函数的每一个参数都可以被一个单独的函数接收
// 3.柯里化的本质是把一个多参数的函数转换成一个嵌套函数，函数的每一个参数都可以被一个单独的函数接收
// 4.柯里化的本
